xml-resources/web-service-references/AuthorizationService_singleWsdl/wsdl/ds.dyndns.org_9000/AuthorizationService.singlewsdl.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="LoginService" targetNamespace="http://ISTP1.Service.Contracts.Service" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://ISTP1.Service.Contracts.Service" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="http://ISTP1.Service.Contracts.Service" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.datacontract.org/2004/07/SGE.Service.Contracts.Data"/><xs:element name="SolicitarAutorizacion"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="codigo" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="SolicitarAutorizacionResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="SolicitarAutorizacionResult" nillable="true" type="q1:Autorizacion" xmlns:q1="http://schemas.datacontract.org/2004/07/SGE.Service.Contracts.Data"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/SGE.Service.Contracts.Data" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/SGE.Service.Contracts.Data"><xs:complexType name="Autorizacion"><xs:sequence><xs:element minOccurs="0" name="Cuit" type="xs:long"/><xs:element minOccurs="0" name="Error" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Sign" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Token" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="Autorizacion" nillable="true" type="tns:Autorizacion"/></xs:schema></wsdl:types><wsdl:message name="ILoginService_SolicitarAutorizacion_InputMessage"><wsdl:part name="parameters" element="tns:SolicitarAutorizacion"/></wsdl:message><wsdl:message name="ILoginService_SolicitarAutorizacion_OutputMessage"><wsdl:part name="parameters" element="tns:SolicitarAutorizacionResponse"/></wsdl:message><wsdl:portType name="ILoginService"><wsdl:operation name="SolicitarAutorizacion"><wsdl:input wsaw:Action="http://ISTP1.Service.Contracts.Service/ILoginService/SolicitarAutorizacion" message="tns:ILoginService_SolicitarAutorizacion_InputMessage"/><wsdl:output wsaw:Action="http://ISTP1.Service.Contracts.Service/ILoginService/SolicitarAutorizacionResponse" message="tns:ILoginService_SolicitarAutorizacion_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="SGEAuthService" type="tns:ILoginService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="SolicitarAutorizacion"><soap:operation soapAction="http://ISTP1.Service.Contracts.Service/ILoginService/SolicitarAutorizacion" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="LoginService"><wsdl:port name="SGEAuthService" binding="tns:SGEAuthService"><soap:address location="http://ds.dyndns.org:9000/AuthorizationService"/></wsdl:port></wsdl:service></wsdl:definitions>