solicitud.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <SolicitarAutorizacion xmlns="http://ISTP1.Service.Contracts.Service">
            <codigo>6E635339-9E86-4287-BE8C-6763A3196687</codigo>
        </SolicitarAutorizacion>
    </soap:Body>
</soap:Envelope>